// 1) Составьте программу, которая принимает с клавиатуры числа, пока не будет введено 
//   значение 99. Программа должна подсчитать, сколько чисел было введено с клавиатуры 
//   (не считая значения 99) и вывести эту информацию на экран.
  
//   ввод: 59, 74, 48, 70, 99 ⇒ вывод: кол-во чисел - 4



// let b;
// let a;
// b = 0;
// a = arg(prompt('Введите число'));
// while (a != 99) {
// b = b + 1;
// a = arg(window('Введите число'));
// }
// window.alert(String('кол-во чисел - ') + String(b));


// 2) Составьте программу, которая принимает с клавиатуры числа, пока не будет введено 
//    значение 999. Программа должна подсчитать, сколько чисел было введено с клавиатуры, 
//    чему равна сумма этих чисел (не считая значения 999), и вывести эту информацию 
//    на экран.

//    ввод: 89, 174, 27, 999 ⇒ вывод: кол-во чисел - 3; сумма = 290

// var b;
// var s;
// var a;
// b = 0;
// s = 0;
// a = arg(prompt('Введите число'));
// while (a != 999) {
// b = b + 1;
// s = s + a;
// a = arg(prompt('Введите число'));
// }
// alert(String('кол-во чисел - ') + String(b));
// alert(String('сумма = ') + String(s));



// 3) Составьте программу, которая принимает с клавиатуры два целых числа, первое из которых - год рождения ученика,
//    а второе – нынешний (текущий) год. 
//    Программа должна вывести на экран возраст ученика (в целых годах).

//    ввод: 2006, 2018 ⇒ вывод: вам 12 лет)

// var a;
// var b;
// var c;
// a = arg(prompt('Введите первое число'));
// b = arg(prompt('Введите второе число'));
// if (a > b) {
// c = a - b;
// alert(c);
// } else if (a < b) {
// c = b - a;
// alert(c);
// } else {
// c = a * b;
// alert(c);
// }


